Revit 2026 API

# IFCProjectLevelGUIDType Enumeration

---

The type of the GUID to be retrieved from Revit.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCProjectLevelGUIDType
```
```vb
Public Enumeration IFCProjectLevelGUIDType
```
```cpp
public enum class IFCProjectLevelGUIDType
```
```fsharp
type IFCProjectLevelGUIDType
```

| Member name | Value | Description |
| --- | --- | --- |
| Building | 1 | The building GUID. |
| Project | 0 | The project GUID. |
| Site | 2 | The site GUID. |

#### Reference

Autodesk.Revit.DB.IFC Namespace